app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Tue, 14 Apr 2015 22:06:57 UTC +00:00], ["updated_at", Tue, 14 Apr 2015 22:06:57 UTC +00:00]]
---
  def create
  	@student = House.all.sample.students.new(student_params)
  	if @student.save